/* Задание №2. Условные конструкции
Дано целое число. Определите и выведите его строку-описание вида:
– "нулевое число";
– "положительное четное число";
– "положительное нечетное число";
– "отрицательное четное число";
– "отрицательное нечетное число".
*/
var x = prompt('','');
var num = Number(x);
if (num === 0) {
    alert("нулевое число");
} else if (num > 0 && num%2===0) {
    alert("положительное четное число");
} else if (num > 0 && num%2===1) {
    alert("положительное нечетное число");
} else if (num < 0 && num%2===0) {
    alert("отрицательное четное число");   
} else {
    alert("отрицательное нечетное число");  
}