/* Задание №4. Условные конструкции
Дано целое число k. Выведите строку-описание оценки, соответствующей числу k (1 – "плохо", 2 – "неудовлетворительно", 3 – "удовлетворительно", 4 – "хорошо", 5 – "отлично"). Если k не лежит в диапазоне 1–5, то вывести строку "ошибка".
*/

var x = 1;
//x = +prompt('','');
switch (x) {
        case 1:
      console.log("плохо");
      break;
        case 2:
      console.log("неудовлетворительно");
      break;
        case 3:
      console.log("удовлетворительно");
      break;
        case 4:
      console.log("хорошо");
      break;
        case 5:
      console.log("отлично");
      break;
        default:
      console.log("ошибка");
}