/* Задание №3. Условные конструкции
Даны четыре целых числа, одно из которых отлично от трех других, равных между собой. Определите порядковый номер числа, отличного от остальных.
*/

var num1 = 2;
var num2 = 2;
var num3 = 3;
var num4 = 2;
 if (num1!=num2 && num1!=num3) {
    alert("наше число под номером 1")
} else if (num1!=num2) {
    alert("Наше число под номером 2")
} else if (num1!=num3){
    alert("наше число под номером 3")
} else {
    alert("наше число под номером 4")
} 